app/services/create_users.rb

    def perform
        user = User.new(@user_params)
        ApplicationRecord.transaction do
            user.save!
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["email", ""], ["password", ""], ["created_at", "2019-10-09 13:31:52.746425"], ["updated_at", "2019-10-09 13:31:52.746425"]]