app/controllers/session_controller.rb

    def user_login
        return if !validate_login_params.nil?
        user = nil
        user = User.find_by_email(login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "\"alisha231195@gmail.com\""], ["LIMIT", 1]]