app/controllers/users_controller.rb

  def show
    User.find_by_id(get_user_by_id_params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]